vlm/base/InformationRegisters/бит_СрокиИзготовленияВПиРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СрокиИзготовленияВПиРиски</Name>
			<Comment>ЛТ3.1</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокБазовыйДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РискУвеличенияСрокаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабочегоЦентра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВоеннаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/base/Catalogs/ВидыРабочихЦентров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыРабочихЦентров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйЗначимыйБуфер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьДоступностьПоГрафикуРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДоступностьРЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияДоступностиРЦ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОжидания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяВариантыНаладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаВремениПереналадки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезервДоступности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараллельнаяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗагрузкиРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланироватьРаботуРабочихЦентров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРабочихЦентров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьДоступностьДляВидаРЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КодВРЦ</Name>
					<Comment>// Первыйбит ЛТ3 ЛапшовГ "GVLapshov@1cbit.ru" 24.03.2025</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеКоличествоПереналадок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалОграниченияПереналадок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяЗагрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ОсновнойХод</Name>
					<Comment>ЛТ5.36</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КрНоим</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/base/InformationRegisters/бит_СрокиИзготовленияВПиРиски/Forms/ФормаЗагрузки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьТабличныйДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.Товары.ТекущиеДанные.КодСтроки = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииЯчейки(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено И Элемент.ТекущийЭлемент.Имя = "ТоварыНоменклатура" Тогда
		ЗаполнитьСписокВыбораНоменклатуры(ТекущаяСтрока.КодСтроки);
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТоварыВРЦ" Тогда
		ЗаполнитьСписокВыбораВРЦ(ТекущаяСтрока.КодСтроки);
	КонецЕсли;
	
КонецПроцедуры

#Область ПоискИСопоставлениеНоменклатуры

&НаСервере
Процедура ДобавитьПодобраннуюНоменклатуру(КодСтроки, НайденнаяНоменклатура, НайденнаяХарактеристика = Неопределено, НайденнаяНоменклатураПартнера = Неопределено)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Номенклатура", НайденнаяНоменклатура);
	Если Не НайденнаяХарактеристика = Неопределено Тогда
		СтруктураОтбора.Вставить("Характеристика", НайденнаяХарактеристика);
	КонецЕсли;	
	СтруктураОтбора.Вставить("КодСтроки", КодСтроки);
	
	ПодобранныеРанееТовары = ПодобраннаяНоменклатура.НайтиСтроки(СтруктураОтбора);
	Если ПодобранныеРанееТовары.Количество() = 0 Тогда
		ПодобраннаяСтрока = ПодобраннаяНоменклатура.Добавить();
		ПодобраннаяСтрока.КодСтроки = КодСтроки;
		ПодобраннаяСтрока.Номенклатура = НайденнаяНоменклатура;
		Если Не НайденнаяНоменклатураПартнера = Неопределено Тогда
			ПодобраннаяСтрока.НоменклатураПартнера = НайденнаяНоменклатураПартнера;
		КонецЕсли;	
		Если Не НайденнаяХарактеристика = Неопределено Тогда
			ПодобраннаяСтрока.Характеристика = НайденнаяХарактеристика;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПодобранныйВРЦ(КодСтроки, НайденныйВРЦ)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ВРЦ", НайденныйВРЦ);	
	СтруктураОтбора.Вставить("КодСтроки", КодСтроки);
	
	ПодобранныеРанее = ПодобранныйВРЦ.НайтиСтроки(СтруктураОтбора);
	Если ПодобранныеРанее.Количество() = 0 Тогда
		ПодобраннаяСтрока = ПодобранныйВРЦ.Добавить();
		ПодобраннаяСтрока.КодСтроки = КодСтроки;
		ПодобраннаяСтрока.ВРЦ = НайденныйВРЦ;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьДанныеТабличногоДокументаСДаннымиИБ()
	
	ОбрабатываемыеСтроки = Новый Массив;
	
	УточнениеНоменклатуры.Очистить();
	ПодобраннаяНоменклатура.Очистить();  
	ПодобранныйВРЦ.Очистить();
	
	НайденныеСтроки = ПодобраннаяНоменклатура.Выгрузить();

	Товары.Очистить();
	
	ДанныеИБ = ПолучитьДанныеИБпоНоменклатуреИВРЦ();
	ТаблицаНоменклатуры = ДанныеИБ.ТаблицаНоменклатуры;
	ТаблицаВРЦ = ДанныеИБ.ТаблицаВРЦ;
	
	НомераКолонок = Новый Соответствие;
	НомерКолонки = 1;
	
	НомераКолонок.Вставить("КолонкаМарка", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаСечение", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаИсполнение", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;   
	НомераКолонок.Вставить("КолонкаАртикул", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаНоменклатура", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаПримечание", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаКодВРЦ", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаВП", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаСрок", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаРиск", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;  
	НомераКолонок.Вставить("КолонкаПользователь", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаДата", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	
	ВысотаШапки = 1;
	НомерСтроки = ВысотаШапки + 1 ;
	
	СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
	ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНоменклатура")).Текст);
		
	Пока ЗаполненыНоменклатураКодАртикулШтрихкод Цикл
		
		НоваяСтрока = УточнениеНоменклатуры.Добавить();
		Количество = 0;
		НоваяСтрока.КодСтроки = НомерСтроки;
		
		Попытка
			НоваяСтрока.Артикул = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаАртикул")).Текст;
			НоваяСтрока.НоменклатураНаименование = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНоменклатура")).Текст;
			НоваяСтрока.КодВРЦ = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКодВРЦ")).Текст;
			НоваяСтрока.ВРЦ = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаПримечание")).Текст;
			
			НоваяСтрока.ВП = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаВП")).Текст;
			
			НоваяСтрока.Марка = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаМарка")).Текст;
			НоваяСтрока.Сечение = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаСечение")).Текст;
			НоваяСтрока.Исполнение = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаИсполнение")).Текст;
			
			
			Срок = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаСрок")).Текст;   
			ПрисвоитьЧисловоеЗначениеПриЗаполненииТЧ(НоваяСтрока.Срок, Срок, НомерСтроки, "Срок", ВысотаШапки);
			
			Риск = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаРиск")).Текст;
			ПрисвоитьЧисловоеЗначениеПриЗаполненииТЧ(НоваяСтрока.Риск, Риск, НомерСтроки, "Риск", ВысотаШапки);
			
			НоваяСтрока.Пользователь = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаПользователь")).Текст;
			ПрисвоитьДату(НоваяСтрока.Дата, ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаДата")).Текст);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		СтрокаПоискаАртикул        = ВРег(СтрЗаменить(НоваяСтрока.Артикул, " ", "")); 
		СтрокаПоискаНоменклатура   = ВРег(СтрЗаменить(НоваяСтрока.НоменклатураНаименование, " ", ""));
		
		СтрокаПоискаКодВРЦ			= ВРег(СтрЗаменить(НоваяСтрока.КодВРЦ, " ", ""));
		СтрокаПоискаВРЦ				= ВРег(СтрЗаменить(НоваяСтрока.ВРЦ, " ", ""));
		
		Если ЗначениеЗаполнено(НоваяСтрока.Артикул) И ЗначениеЗаполнено(НоваяСтрока.НоменклатураНаименование)  Тогда
			НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("АртикулПоиск, НаименованиеПоиск", СтрокаПоискаАртикул,	СтрокаПоискаНоменклатура));
			Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
				НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("АртикулПоиск, НаименованиеПолноеПоиск",	СтрокаПоискаАртикул, СтрокаПоискаНоменклатура));
				Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
					НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("АртикулПоиск", СтрокаПоискаАртикул));
				КонецЕсли;
			КонецЕсли;
			Для каждого НоменклатураПоКлючу из НайденнаяНоменклатураПоКлючу Цикл
					ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НоменклатураПоКлючу.Номенклатура);
			КонецЦикла;
			
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.Артикул) И НЕ ЗначениеЗаполнено(НоваяСтрока.НоменклатураНаименование)  Тогда
			
			НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("АртикулПоиск",	СтрокаПоискаАртикул));
			Для каждого НоменклатураПоКлючу из НайденнаяНоменклатураПоКлючу Цикл
					ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НоменклатураПоКлючу.Номенклатура);
			КонецЦикла;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(НоваяСтрока.Артикул) И ЗначениеЗаполнено(НоваяСтрока.НоменклатураНаименование)  Тогда
			
				НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("НаименованиеПоиск",	СтрокаПоискаНоменклатура));
				Если НайденнаяНоменклатураПоКлючу.Количество() = 0 Тогда
					НайденнаяНоменклатураПоКлючу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("НаименованиеПолноеПоиск", СтрокаПоискаНоменклатура));
				КонецЕсли;
				Для каждого НоменклатураПоКлючу из НайденнаяНоменклатураПоКлючу Цикл
						ДобавитьПодобраннуюНоменклатуру(НомерСтроки, НоменклатураПоКлючу.Номенклатура);
				КонецЦикла;
				
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(НоваяСтрока.КодВРЦ) Тогда
		//	НайденныйВРЦПоКлючу = ТаблицаВРЦ.НайтиСтроки(Новый Структура("КодВРЦПоиск", СтрокаПоискаКодВРЦ));
		//	Для каждого ВРЦПоКлючу из НайденныйВРЦПоКлючу Цикл
		//		ДобавитьПодобранныйВРЦ(НомерСтроки, ВРЦПоКлючу.ВРЦ);
		//	КонецЦикла;
		//ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.ВРЦ) Тогда
		//	НайденныйВРЦПоКлючу = ТаблицаВРЦ.НайтиСтроки(Новый Структура("НаименованиеПоиск", СтрокаПоискаВРЦ));
		//	Для каждого ВРЦПоКлючу из НайденныйВРЦПоКлючу Цикл
		//		ДобавитьПодобранныйВРЦ(НомерСтроки, ВРЦПоКлючу.ВРЦ);
		//	КонецЦикла;
		//КонецЕсли;
		
		// Заполнение тч Товары.
		НоваяСтрокаТовары = Товары.Добавить();  
		НоваяСтрокаТовары.ЗагружаемаяМарка         	 = НоваяСтрока.Марка;
		НоваяСтрокаТовары.ЗагружаемоеСечение         = НоваяСтрока.Сечение;
		НоваяСтрокаТовары.ЗагружаемоеИсполнение      = НоваяСтрока.Исполнение; 
		НоваяСтрокаТовары.ЗагружаемыйАртикул         = НоваяСтрока.Артикул;
		НоваяСтрокаТовары.ЗагружаемаяНоменклатура    = НоваяСтрока.НоменклатураНаименование;
		НоваяСтрокаТовары.ЗагружаемыйВРЦ		     = НоваяСтрока.ВРЦ; 
		НоваяСтрокаТовары.ЗагружаемыйКодВРЦ			 = НоваяСтрока.КодВРЦ;
		НоваяСтрокаТовары.ЗагружаемыйВП		     	 = НоваяСтрока.ВП; 
		
		ПрисвоитьБулевоЗначениеПриЗаполненииТЧ(НоваяСтрокаТовары.ВП, НоваяСтрока.ВП); 
		
		НоваяСтрокаТовары.КодСтроки                  = НомерСтроки;
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары, НоваяСтрока,,"Артикул");
		
		МассивПодобраннойНоменклатуры = ПодобраннаяНоменклатура.НайтиСтроки(Новый Структура("КодСтроки", НомерСтроки));
		
		Если МассивПодобраннойНоменклатуры.Количество() = 1 Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары, МассивПодобраннойНоменклатуры.Получить(0));
		ИначеЕсли МассивПодобраннойНоменклатуры.Количество() = 0 Тогда
			ТекстОшибки = НСтр("ru = 'По данным для поиска в строке %НомерСтроки% совпадений не найдено.';
								|en = 'No matches by data for search in line %НомерСтроки%.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки-ВысотаШапки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Иначе
			ТекстОшибки = НСтр("ru = 'По данным для поиска в строке %НомерСтроки% найдено несколько совпадений.';
								|en = 'Several matches are found by data for search in line %НомерСтроки%.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки-ВысотаШапки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;                  
		
		Если ЗначениеЗаполнено(НоваяСтрокаТовары.Номенклатура) Тогда 	
			НоваяСтрокаТовары.ВРЦ = ВРЦ(НоваяСтрокаТовары.Номенклатура, НоваяСтрокаТовары.Дата);
		КонецЕсли;
		
		//МассивПодобранногоВРЦ = ПодобранныйВРЦ.НайтиСтроки(Новый Структура("КодСтроки", НомерСтроки));
		//
		//Если МассивПодобранногоВРЦ.Количество() = 1 Тогда
		//	ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары, МассивПодобранногоВРЦ.Получить(0));
		//ИначеЕсли МассивПодобранногоВРЦ.Количество() = 0 Тогда
		//	ТекстОшибки = НСтр("ru = 'По данным для поиска в строке %НомерСтроки% совпадений для ВРЦ не найдено.';
		//						|en = 'No matches by data for search in line %НомерСтроки%.'");
		//	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки-ВысотаШапки);
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		//Иначе
		//	ТекстОшибки = НСтр("ru = 'По данным для поиска в строке %НомерСтроки% найдено несколько совпадений для ВРЦ.';
		//						|en = 'Several matches are found by data for search in line %НомерСтроки%.'");
		//	ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", НомерСтроки-ВысотаШапки);
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		//КонецЕсли;
		
		НоваяСтрокаТовары.ЗагружаемыйПользователь = НоваяСтрока.Пользователь;
		НоваяСтрокаТовары.Пользователь = Справочники.Пользователи.НайтиПоНаименованию(НоваяСтрока.Пользователь);
		ОбрабатываемыеСтроки.Добавить(НоваяСтрокаТовары);
		
		НомерСтроки = НомерСтроки + 1;
		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		
		Попытка
			ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНоменклатура")).Текст);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
	УточнениеНоменклатуры.Очистить();
	
КонецПроцедуры

&НаСервере
Функция ПодобратьНоменклатуруПоШтрихкоду(Штрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО (ВариантыКомплектацииНоменклатуры.Владелец = ШтрихкодыНоменклатуры.Номенклатура)
		|			И (ВариантыКомплектацииНоменклатуры.Владелец.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор))
		|			И (ВариантыКомплектацииНоменклатуры.Характеристика = ШтрихкодыНоменклатуры.Характеристика)
		|			И (ВариантыКомплектацииНоменклатуры.Основной)
		|ГДЕ
		|	ИСТИНА
		|	И ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
		|";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Возврат Запрос.Выполнить().Выбрать();   
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеИБпоНоменклатуреИВРЦ()
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаНоменклатуры", Новый ТаблицаЗначений);
	Результат.Вставить("ТаблицаВРЦ", Новый ТаблицаЗначений);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.Код КАК Код,
		|	Номенклатура.Артикул КАК Артикул,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыРабочихЦентров.Ссылка КАК ВРЦ,
		|	ВидыРабочихЦентров.Наименование КАК Наименование,
		|	ВидыРабочихЦентров.бит_КодВРЦ КАК КодВРЦ
		|ИЗ
		|	Справочник.ВидыРабочихЦентров КАК ВидыРабочихЦентров
		|ГДЕ
		|	НЕ ВидыРабочихЦентров.ПометкаУдаления
		|	И НЕ ВидыРабочихЦентров.ЭтоГруппа";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатЗапроса = МассивРезультатов[0]; // РезультатЗапроса

	Для Каждого КолонкаРезультата Из РезультатЗапроса.Колонки Цикл
		Результат.ТаблицаНоменклатуры.Колонки.Добавить(КолонкаРезультата.Имя);
	КонецЦикла;
	Результат.ТаблицаНоменклатуры.Колонки.Добавить("АртикулПоиск");
	Результат.ТаблицаНоменклатуры.Колонки.Добавить("НаименованиеПоиск");
	Результат.ТаблицаНоменклатуры.Колонки.Добавить("НаименованиеПолноеПоиск");
	ВыборкаТаблицыНоменклатуры = РезультатЗапроса.Выбрать();
	Пока ВыборкаТаблицыНоменклатуры.Следующий() Цикл
		НоваяСтрокаТаблицыНоменклатуры = Результат.ТаблицаНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыНоменклатуры, ВыборкаТаблицыНоменклатуры);
		
		НоваяСтрокаТаблицыНоменклатуры.АртикулПоиск = ВРег(СтрЗаменить(НоваяСтрокаТаблицыНоменклатуры.Артикул, " ", ""));
		НоваяСтрокаТаблицыНоменклатуры.НаименованиеПоиск = ВРег(СтрЗаменить(НоваяСтрокаТаблицыНоменклатуры.Наименование, " ", ""));
		НоваяСтрокаТаблицыНоменклатуры.НаименованиеПолноеПоиск = ВРег(СтрЗаменить(НоваяСтрокаТаблицыНоменклатуры.НаименованиеПолное, " ", ""));
	КонецЦикла;
	
	РезультатЗапроса = МассивРезультатов[1]; // РезультатЗапроса
	
	Для Каждого КолонкаРезультата Из РезультатЗапроса.Колонки Цикл
		Результат.ТаблицаВРЦ.Колонки.Добавить(КолонкаРезультата.Имя);
	КонецЦикла;
	Результат.ТаблицаВРЦ.Колонки.Добавить("НаименованиеПоиск");
	Результат.ТаблицаВРЦ.Колонки.Добавить("КодВРЦПоиск");
	ВыборкаТаблицы = РезультатЗапроса.Выбрать();
	Пока ВыборкаТаблицы.Следующий() Цикл
		НоваяСтрокаТаблицы = Результат.ТаблицаВРЦ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, ВыборкаТаблицы);
		
		НоваяСтрокаТаблицы.НаименованиеПоиск 	= ВРег(СтрЗаменить(НоваяСтрокаТаблицы.Наименование, " ", ""));
		НоваяСтрокаТаблицы.КодВРЦПоиск			= ВРег(СтрЗаменить(НоваяСтрокаТаблицы.КодВРЦ, " ", ""));
	КонецЦикла;

	Возврат Результат; 
	
КонецФункции
    
#КонецОбласти

#Область Прочее

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	
	МакетЗаполненияПоВнешнемуИсточнику = РегистрыСведений.бит_СрокиИзготовленияВПиРиски.ПолучитьМакет("МакетЗагрузкиДанных");
	ТабличныйДокумент.Очистить();
	
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Марка");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Сечение");
	ТабличныйДокумент.Присоединить(ОбластьТовары);                             
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Исполнение");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Артикул");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Номенклатура");
	ОбластьТовары.Параметры.ЗаголовокТоварноеМесто = НСтр("ru = 'Номенклатура';
																|en = 'Items'");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Примечание");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("КодВРЦ");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("ВП");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Срок");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Риск");
	ТабличныйДокумент.Присоединить(ОбластьТовары);          
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Пользователь");
	ТабличныйДокумент.Присоединить(ОбластьТовары);
	ОбластьТовары = МакетЗаполненияПоВнешнемуИсточнику.ПолучитьОбласть("Дата");
	ТабличныйДокумент.Присоединить(ОбластьТовары);


	ТабличныйДокумент.ФиксацияСверху = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораНоменклатуры(КодТекущейСтроки)
	
	СписокВыбораНоменклатура  = Элементы.ТоварыНоменклатура.СписокВыбора;
	СписокВыбораНоменклатура.Очистить();
	
	МассивПодобраннойНоменклатуры = ПодобраннаяНоменклатура.НайтиСтроки(Новый Структура("КодСтроки", КодТекущейСтроки));
	Для каждого ЭлементМассива Из МассивПодобраннойНоменклатуры Цикл
		Если СписокВыбораНоменклатура.НайтиПоЗначению(ЭлементМассива.Номенклатура) = Неопределено Тогда
			СписокВыбораНоменклатура.Добавить(ЭлементМассива.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораВРЦ(КодТекущейСтроки)
	
	СписокВыбора  = Элементы.ТоварыВРЦ.СписокВыбора;
	СписокВыбора.Очистить();
	
	МассивПодобранногоВРЦ = ПодобранныйВРЦ.НайтиСтроки(Новый Структура("КодСтроки", КодТекущейСтроки));
	Для каждого ЭлементМассива Из МассивПодобранногоВРЦ Цикл
		Если СписокВыбора.НайтиПоЗначению(ЭлементМассива.ВРЦ) = Неопределено Тогда
			СписокВыбора.Добавить(ЭлементМассива.ВРЦ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
    Естьошибки = Ложь;
	Для сч = 2 по ТабличныйДокумент.ВысотаТаблицы Цикл                                        
		СоставноеНазвание = СокрЛП(ТабличныйДокумент.Область("R"+Формат(сч, "Ч=0")+"C1").Текст);
		СоставноеНазвание = СоставноеНазвание + ?(СоставноеНазвание = "", "", " ") + СокрЛП(ТабличныйДокумент.Область("R"+Формат(сч, "Ч=0")+"C2").Текст);
		СоставноеНазвание = СоставноеНазвание + ?(СоставноеНазвание = "", "", " ") + СокрЛП(ТабличныйДокумент.Область("R"+Формат(сч, "Ч=0")+"C3").Текст);
		ТабличныйДокумент.Область("R"+Формат(сч, "Ч=0")+"C5").Текст	= СоставноеНазвание;	
		
		ДатаСтрока = СокрЛП(ТабличныйДокумент.Область("R"+Формат(сч, "Ч=0")+"C12").Текст);	
		Попытка
			чДаты = СтрРазделить(ДатаСтрока, ".");
			ДатаЧислом = Дата(чДаты[2]+чДаты[1]+чДаты[0]);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("в строке " + сч + " не удалось преобразовать " + ДатаСтрока + " к дате");
			Естьошибки = Истина;
		КонецПопытки;
	КонецЦикла;

	Если Естьошибки Тогда
		Возврат;
	КонецЕсли;
	
	
	ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C5").Текст);
			
	Если Не ЗаполненыНоменклатураКодАртикулШтрихкод Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла.';
													|en = 'You must copy columns to the table from an external file.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C6").Текст) И Не ЗначениеЗаполнено(ТабличныйДокумент.Область("R2C7").Текст)  Тогда 
		ПоказатьПредупреждение(Неопределено, "Не заполнен вид рабочего центра");
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Состояние(НСтр("ru = 'Осуществляется сопоставление введенных данных с данными информационной базы. Пожалуйста подождите...';
					|en = 'Entered data is being mapped with the infobase data. Please wait...'"),,,БиблиотекаКартинок.Информация32);
	СопоставитьДанныеТабличногоДокументаСДаннымиИБ();

	Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг2;
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Элементы.Шаги.ТекущаяСтраница = Элементы.Шаг1;
КонецПроцедуры

&НаКлиенте
асинх Процедура ПеренестиТовары(Команда)
	
	текст = НСтр("ru='Записать данные в регистр?'");	
	
	Обещание = ВопросАсинх(текст, РежимДиалогаВопрос.ДаНет);
	Результат = Ждать Обещание; 
	Если Результат = КодВозвратаДиалога.Да Тогда	
		ЗаписатьНаСервере();   
	КонецЕсли;
    ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка завершена");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	тзТовары = Товары.Выгрузить(, "Номенклатура, ВРЦ, ВП, Срок, Риск, Пользователь, Дата");
	тзТовары.Свернуть("Номенклатура, ВРЦ, ВП, Срок, Риск, Пользователь, Дата");
	//Дата = ТекущаяДатаСеанса();
	//Пользователь = Пользователи.АвторизованныйПользователь();
	Для каждого стр из тзТовары Цикл
		Если Не ЗначениеЗаполнено(стр.Срок) и Не ЗначениеЗаполнено(стр.Риск) 
			Или Не ЗначениеЗаполнено(стр.Номенклатура)
			Или Не ЗначениеЗаполнено(стр.ВРЦ) Тогда
			Продолжить;
		КонецЕсли;
		
		МЗ = РегистрыСведений.бит_СрокиИзготовленияВПиРиски.СоздатьМенеджерЗаписи(); 
		МЗ.Номенклатура = стр.Номенклатура;
		МЗ.ВидРабочегоЦентра = стр.ВРЦ;
		МЗ.ВоеннаяПродукция = стр.ВП;
		МЗ.СрокБазовыйДни = стр.Срок;
		МЗ.РискУвеличенияСрокаДни = стр.Риск;
		МЗ.ДатаДобавления = стр.Дата;
		МЗ.Пользователь = стр.Пользователь; 
		МЗ.Записать(); 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции




&НаКлиентеНаСервереБезКонтекста
Функция ПрисвоитьЧисловоеЗначениеПриЗаполненииТЧ(Приемник, СтрокаИсточникЧисловогоЗначения, АбсолютныйНомерСтроки, НазваниеКолонки, ВысотаШапки = 0)
	
	Успех = Истина;
	
	ЗначениеДляПриведения = СтрЗаменить(СтрокаИсточникЧисловогоЗначения, " ", "");
	Если ЗначениеЗаполнено(ЗначениеДляПриведения) Тогда
		мТипов = Новый Массив;
		мТипов.Добавить(Тип("Число"));
		мТипов.Добавить(Тип("ОписаниеТипов"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(мТипов);
		ПриведенноеЗначение = ОписаниеТиповЧ.ПривестиЗначение(ЗначениеДляПриведения);
		Если Не ПриведенноеЗначение = Неопределено Тогда
			Приемник = ПриведенноеЗначение;			
		Иначе
			Успех = Ложь;
			ТекстОшибки = НСтр("ru = 'В строке %НомерСтроки%, колонке ""%Колонка%"" введено значение ""%Значение%"", не являющееся числом.';
								|en = 'In line %НомерСтроки% in column ""%Колонка%"", value ""%Значение%"" is entered. The value is not a digit.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерСтроки%", АбсолютныйНомерСтроки-ВысотаШапки);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Колонка%", НазваниеКолонки);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Значение%", СтрокаИсточникЧисловогоЗначения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;	
	Иначе
		Приемник = 0;
	КонецЕсли;
	
	Возврат Успех; 
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПрисвоитьБулевоЗначениеПриЗаполненииТЧ(Приемник, СтрокаИсточникЗначения)
	
	Успех = Истина;
	
	ЗначениеДляПриведения = СтрЗаменить(ВРег(СтрокаИсточникЗначения), "ЛОЖЬ", "");
	ЗначениеДляПриведения = СтрЗаменить(ЗначениеДляПриведения, "0", "");
	ЗначениеДляПриведения = СтрЗаменить(ВРег(ЗначениеДляПриведения), "НЕТ", "");
	ЗначениеДляПриведения = СтрЗаменить(ВРег(ЗначениеДляПриведения), "-", "");
	
	Приемник = ЗначениеЗаполнено(ЗначениеДляПриведения);

	Возврат Успех;                                    
	
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Функция ПрисвоитьДату(Приемник, СтрокаИсточникЗначения)
	
	Успех = Истина;
	
	ДатаСтрока = СокрЛП(СтрокаИсточникЗначения);	
	Попытка
		чДаты = СтрРазделить(ДатаСтрока, ".");
		Приемник = Дата(чДаты[2]+чДаты[1]+чДаты[0]);
	Исключение
		Успех = Ложь;
	КонецПопытки;

	Возврат Успех;                                    
	
КонецФункции

&НаСервере
функция ВРЦ(Номенклатура, ДатаДобавления)
	
	ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.ПустаяСсылка();
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Спецификация = бит_ОбщегоНазначенияСервер.СпецификацияНоменклатуры(Номенклатура, ДатаДобавления);
		Операция = Неопределено;
		бит_ОбщегоНазначенияСервер.ПолучитьПоследниеЭтапОперацияПоСпецификации(Спецификация, , Операция);
		Если Операция <> Неопределено Тогда
			ВидРабочегоЦентра = Операция.РабочийЦентр;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВидРабочегоЦентра;

КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)   

	ТД = Элементы.товары.ТекущиеДанные;
	Если ТД = Неопределено ТОгда
		Возврат;
	КонецЕсли;
	ТД.ВРЦ = ВРЦ(ТД.Номенклатура, ТД.Дата);

КонецПроцедуры

#КонецОбласти
